---
kind: property
id: P:Autodesk.Revit.DB.Macros.IEntryPoint.AddinFolder
source: html/15974d8d-fda8-5837-09e1-b77f44859d50.htm
---
# Autodesk.Revit.DB.Macros.IEntryPoint.AddinFolder Property

## Syntax (C#)
```csharp
string AddinFolder { get; }
```